export default {
  "/进阶实战/Vue3.5 企业级管理系统实战/": [
    {
      text: "Vue3.5 企业级管理系统实战",
      items: [
        {
          text: "00 项目初始搭建与配置",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/00 项目初始搭建与配置",
        },
        {
          text: "01 Router、Pinia 及 Element-Plus 集成",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/01 Router、Pinia 及 Element-Plus 集成",
        },
        {
          text: "02 页面布局及样式处理 （Scss & UnoCSS ）",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/02 页面布局及样式处理 （Scss & UnoCSS ）",
        },
        {
          text: "03 组件及API自动导入配置",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/03 组件及API自动导入配置",
        },
        {
          text: "04 图标组件",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/04 图标组件",
        },
        {
          text: "05 Vue3中defineProps用法",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/05 Vue3中defineProps用法",
        },
        {
          text: "06 Sidebar组件开发 1",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/06 Sidebar组件开发 1",
        },
        {
          text: "07 Sidebar组件开发 2",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/07 Sidebar组件开发 2",
        },
        {
          text: "08 菜单组件",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/08 菜单组件",
        },
        {
          text: "09 面包屑导航组件",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/09 面包屑导航组件",
        },
        {
          text: "10 全屏切换组件",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/10 全屏切换组件",
        },
        {
          text: "11 组件尺寸及多语言实现",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/11 组件尺寸及多语言实现",
        },
        {
          text: "12 TagsView标签栏导航",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/12 TagsView标签栏导航",
        },
        {
          text: "13 动态主题切换",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/13 动态主题切换",
        },
        {
          text: "14 其他全局设置项",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/14 其他全局设置项",
        },
        {
          text: "15 登录登出及鉴权",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/15 登录登出及鉴权",
        },
        {
          text: "16 角色管理",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/16 角色管理",
        },
        {
          text: "17 用户管理",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/17 用户管理",
        },
        {
          text: "18 菜单管理",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/18 菜单管理",
        },
        {
          text: "19 角色菜单",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/19 角色菜单",
        },
        {
          text: "20 菜单权限",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/20 菜单权限",
        },
        {
          text: "21 动态菜单",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/21 动态菜单",
        },
        {
          text: "22 权限指令",
          link: "/进阶实战/Vue3.5 企业级管理系统实战/22 权限指令",
        },
      ],
    },
  ],
  "/进阶实战/二次封装Element-Plus组件/": [
    {
      text: "二次封装Element-Plus组件",
      items: [
        {
          text: "00 封装组件初级篇（上）",
          link: "/进阶实战/二次封装Element-Plus组件/00 封装组件初级篇（上）",
        },
        {
          text: "01 封装组件初级篇（下）",
          link: "/进阶实战/二次封装Element-Plus组件/01 封装组件初级篇（下）",
        },
        {
          text: "02 封装组件中级篇",
          link: "/进阶实战/二次封装Element-Plus组件/02 封装组件中级篇",
        },
        {
          text: "03 封装组件高级篇（上）",
          link: "/进阶实战/二次封装Element-Plus组件/03 封装组件高级篇（上）",
        },
        {
          text: "04 封装组件高级篇（下）",
          link: "/进阶实战/二次封装Element-Plus组件/04 封装组件高级篇（下）",
        },
      ],
    },
  ],
  "/进阶实战/打造媲美Element-Plus的组件库/": [
    {
      text: "打造媲美Element-Plus的组件库",
      items: [
        {
          text: "00 万事开头难 - Button 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/00 万事开头难 - Button 组件",
        },
        {
          text: "01 更近一步 Collapse 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/01 更近一步 Collapse 组件",
        },
        {
          text: "02 它山之石 - Icon 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/02 它山之石 - Icon 组件",
        },
        {
          text: "03 通用组件 -Tooltip 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/03 通用组件 -Tooltip 组件",
        },
        {
          text: "04 现学现卖 - Dropdown 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/04 现学现卖 - Dropdown 组件",
        },
        {
          text: "05 高难度 - Message 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/05 高难度 - Message 组件",
        },
        {
          text: "06 进入表单的世界 - Input 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/06 进入表单的世界 - Input 组件",
        },
        {
          text: "07 狸猫换太子 - Switch 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/07 狸猫换太子 - Switch 组件",
        },
        {
          text: "08 魔高一丈- Select 组件",
          link: "/进阶实战/打造媲美Element-Plus的组件库/08 魔高一丈- Select 组件",
        },
        {
          text: "09 组件测试",
          link: "/进阶实战/打造媲美Element-Plus的组件库/09 组件测试",
        },
        {
          text: "10 组件库的打包以及发布",
          link: "/进阶实战/打造媲美Element-Plus的组件库/10 组件库的打包以及发布",
        },
      ],
    },
  ],
  "/进阶实战/深入浅出Vite/": [
    {
      text: "深入浅出Vite",
      items: [
        {
          text: "00 开篇：让 Vite 助力你的前端工程化之路",
          link: "/进阶实战/深入浅出Vite/00 开篇：让 Vite 助力你的前端工程化之路",
        },
        {
          text: "01 模块标准：为什么 ESM 是前端模块化的未来？",
          link: "/进阶实战/深入浅出Vite/01 模块标准：为什么 ESM 是前端模块化的未来？",
        },
        {
          text: "02 快速上手：如何用 Vite 从零搭建前端项目？",
          link: "/进阶实战/深入浅出Vite/02 快速上手：如何用 Vite 从零搭建前端项目？",
        },
        {
          text: "03 样式方案：在 Vite 中接入现代化的 CSS 工程化方案",
          link: "/进阶实战/深入浅出Vite/03 样式方案：在 Vite 中接入现代化的 CSS 工程化方案",
        },
        {
          text: "04 代码规范：如何利用 Lint 工具链来保证代码风格和质量？",
          link: "/进阶实战/深入浅出Vite/04 代码规范：如何利用 Lint 工具链来保证代码风格和质量？",
        },
        {
          text: "05 静态资源：如何在 Vite 中处理各种静态资源？",
          link: "/进阶实战/深入浅出Vite/05 静态资源：如何在 Vite 中处理各种静态资源？",
        },
        {
          text: "06 预构建：如何玩转秒级依赖预构建的能力？",
          link: "/进阶实战/深入浅出Vite/06 预构建：如何玩转秒级依赖预构建的能力？",
        },
        {
          text: "07 双引擎架构：Vite 是如何站在巨人的肩膀上实现的？",
          link: "/进阶实战/深入浅出Vite/07 双引擎架构：Vite 是如何站在巨人的肩膀上实现的？",
        },
        {
          text: "08 得力的性能推手：Esbuild 功能使用与插件开发实战",
          link: "/进阶实战/深入浅出Vite/08 得力的性能推手：Esbuild 功能使用与插件开发实战",
        },
        {
          text: "09 Vite 构建基石(上)——Rollup 打包基本概念及使用",
          link: "/进阶实战/深入浅出Vite/09 Vite 构建基石(上)——Rollup 打包基本概念及使用",
        },
        {
          text: "10 Vite 构建基石(下)——深入理解 Rollup 的插件机制",
          link: "/进阶实战/深入浅出Vite/10 Vite 构建基石(下)——深入理解 Rollup 的插件机制",
        },
        {
          text: "11 插件开发与实战：如何开发一个完整的 Vite 插件？",
          link: "/进阶实战/深入浅出Vite/11 插件开发与实战：如何开发一个完整的 Vite 插件？",
        },
        {
          text: "12 HMR API 及原理：代码改动后，如何进行毫秒级别 的局部更新？",
          link: "/进阶实战/深入浅出Vite/12 HMR API 及原理：代码改动后，如何进行毫秒级别 的局部更新？",
        },
        {
          text: "13 代码分割：打包完产物体积太大，怎么拆包？",
          link: "/进阶实战/深入浅出Vite/13 代码分割：打包完产物体积太大，怎么拆包？",
        },
        {
          text: "14 语法降级与Polyfill：联合前端编译工具链，消灭低版 本浏览器兼容问题",
          link: "/进阶实战/深入浅出Vite/14 语法降级与Polyfill：联合前端编译工具链，消灭低版 本浏览器兼容问题",
        },
        {
          text: "19 性能优化：如何体系化地对 Vite 项目进行性能优化？",
          link: "/进阶实战/深入浅出Vite/19 性能优化：如何体系化地对 Vite 项目进行性能优化？",
        },
      ],
    },
  ],
};
