export default {
  text: "前端架构",
  items: [
    {
      text: "阶段一：课程设计及前端创建脚手架开发",
      link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/00 第1周   需求分析和架构设计：做什么，如何做？",
    },
    {
      text: "阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建",
      link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/00 第7周   B端项目需求分析 和 架构设计",
    },
    {
      text: "阶段三：从 0 搭建编辑器服务端",
      link: "/前端架构/阶段三：从 0 搭建编辑器服务端/00 第14周   后端技术选型以及基础知识巩固",
    },
    {
      text: "阶段四：完善B端所有功能，前后端结合和性能优化",
      link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/00 第18周   编辑器组件图层面板功能开发",
    },
    {
      text: "阶段五：完善服务端，发布上线",
      link: "/前端架构/阶段五：完善服务端，发布上线/00 第25周   脚手架功能升级-上手大厂开发模式",
    },
    {
      text: "阶段六：前端发布脚手架开发",
      link: "/前端架构/阶段六：前端发布脚手架开发/00 第30周   脚手架发布模块架构设计和核心流程开发",
    },
    {
      text: "阶段七：架构师领导力培养",
      link: "/前端架构/阶段七：架构师领导力培养/00 第37周   大厂如何管理多人协作的研发项目",
    },
  ],
};
