export default {
  "/前端架构/阶段一：课程设计及前端创建脚手架开发/": [
    {
      text: "阶段一：课程设计及前端创建脚手架开发",
      items: [
        {
          text: "00 第1周   需求分析和架构设计：做什么，如何做？",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/00 第1周   需求分析和架构设计：做什么，如何做？",
        },
        {
          text: "01 第2周   脚手架架构设计和框架搭建",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/01 第2周   脚手架架构设计和框架搭建",
        },
        {
          text: "02 第3周   脚手架核心流程开发",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/02 第3周   脚手架核心流程开发",
        },
        {
          text: "03 第4周   脚手架命令注册和执行过程开发",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/03 第4周   脚手架命令注册和执行过程开发",
        },
        {
          text: "04 第5周   脚手架创建项目流程设计和开发",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/04 第5周   脚手架创建项目流程设计和开发",
        },
        {
          text: "05 第6周   脚手架项目和组件初始化开发",
          link: "/前端架构/阶段一：课程设计及前端创建脚手架开发/05 第6周   脚手架项目和组件初始化开发",
        },
      ],
    },
  ],
  "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/": [
    {
      text: "阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建",
      items: [
        {
          text: "00 第7周   B端项目需求分析 和 架构设计",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/00 第7周   B端项目需求分析 和 架构设计",
        },
        {
          text: "01 第8周   前端基础技术回顾和巡礼",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/01 第8周   前端基础技术回顾和巡礼",
        },
        {
          text: "02 第9周   项目整体搭建",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/02 第9周   项目整体搭建",
        },
        {
          text: "03 第10周   编辑器基本布局，及业务组件库初步开发",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/03 第10周   编辑器基本布局，及业务组件库初步开发",
        },
        {
          text: "04 第11周   掌握测试基本工具，给组件库添加单元测试",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/04 第11周   掌握测试基本工具，给组件库添加单元测试",
        },
        {
          text: "05 第12周   通用上传组件开发以及使用",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/05 第12周   通用上传组件开发以及使用",
        },
        {
          text: "06 第13周   业务组件库打包、发布，添加 CICD",
          link: "/前端架构/阶段二：B端项目分析和设计，编辑器初步编码，业务组件库的搭建/06 第13周   业务组件库打包、发布，添加 CICD",
        },
      ],
    },
  ],
  "/前端架构/阶段三：从 0 搭建编辑器服务端/": [
    {
      text: "阶段三：从 0 搭建编辑器服务端",
      items: [
        {
          text: "00 第14周   后端技术选型以及基础知识巩固",
          link: "/前端架构/阶段三：从 0 搭建编辑器服务端/00 第14周   后端技术选型以及基础知识巩固",
        },
        {
          text: "01 第15周   用户系统设计与实现",
          link: "/前端架构/阶段三：从 0 搭建编辑器服务端/01 第15周   用户系统设计与实现",
        },
        {
          text: "02 第16周   文件上传（本地 + OSS 云服务）",
          link: "/前端架构/阶段三：从 0 搭建编辑器服务端/02 第16周   文件上传（本地 + OSS 云服务）",
        },
        {
          text: "03 第17周   部署 以及 CICD",
          link: "/前端架构/阶段三：从 0 搭建编辑器服务端/03 第17周   部署 以及 CICD",
        },
      ],
    },
  ],
  "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/": [
    {
      text: "阶段四：完善B端所有功能，前后端结合和性能优化",
      items: [
        {
          text: "00 第18周   编辑器组件图层面板功能开发",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/00 第18周   编辑器组件图层面板功能开发",
        },
        {
          text: "01 第19周   让元素动起来 - 编辑器画布交互功能开发",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/01 第19周   让元素动起来 - 编辑器画布交互功能开发",
        },
        {
          text: "02 第20周   前后端结合 - 编辑器整合后端接口",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/02 第20周   前后端结合 - 编辑器整合后端接口",
        },
        {
          text: "03 第21周   整合开发 B 端其他页面的各种功能",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/03 第21周   整合开发 B 端其他页面的各种功能",
        },
        {
          text: "04 第22周   大型项目的编译，部署以及性能优化",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/04 第22周   大型项目的编译，部署以及性能优化",
        },
        {
          text: "05 第23周   学习使用Nuxt创建管理系统 基础学习",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/05 第23周   学习使用Nuxt创建管理系统 基础学习",
        },
        {
          text: "06 第24周   学习使用Nuxt创建管理系统：实战进阶",
          link: "/前端架构/阶段四：完善B端所有功能，前后端结合和性能优化/06 第24周   学习使用Nuxt创建管理系统：实战进阶",
        },
      ],
    },
  ],
  "/前端架构/阶段五：完善服务端，发布上线/": [
    {
      text: "阶段五：完善服务端，发布上线",
      items: [
        {
          text: "00 第25周   脚手架功能升级-上手大厂开发模式",
          link: "/前端架构/阶段五：完善服务端，发布上线/00 第25周   脚手架功能升级-上手大厂开发模式",
        },
        {
          text: "01 第26周   脚手架功能升级-代码复用能力开发",
          link: "/前端架构/阶段五：完善服务端，发布上线/01 第26周   脚手架功能升级-代码复用能力开发",
        },
        {
          text: "02 第27周   前端监控平台之JS 库开发",
          link: "/前端架构/阶段五：完善服务端，发布上线/02 第27周   前端监控平台之JS 库开发",
        },
        {
          text: "03 第28周   前端监控平台之大数据开发",
          link: "/前端架构/阶段五：完善服务端，发布上线/03 第28周   前端监控平台之大数据开发",
        },
        {
          text: "04 第29周   前端监控平台之数据可视化开发",
          link: "/前端架构/阶段五：完善服务端，发布上线/04 第29周   前端监控平台之数据可视化开发",
        },
      ],
    },
  ],
  "/前端架构/阶段六：前端发布脚手架开发/": [
    {
      text: "阶段六：前端发布脚手架开发",
      items: [
        {
          text: "00 第30周   脚手架发布模块架构设计和核心流程开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/00 第30周   脚手架发布模块架构设计和核心流程开发",
        },
        {
          text: "01 第31周   脚手架发布模块git自动化流程开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/01 第31周   脚手架发布模块git自动化流程开发",
        },
        {
          text: "02 第32周   脚手架发布模块云构建系统开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/02 第32周   脚手架发布模块云构建系统开发",
        },
        {
          text: "03 第33周   脚手架发布模块云发布功能开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/03 第33周   脚手架发布模块云发布功能开发",
        },
        {
          text: "04 第34周   脚手架组件发布功能开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/04 第34周   脚手架组件发布功能开发",
        },
        {
          text: "05 第35周   组件平台开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/05 第35周   组件平台开发",
        },
        {
          text: "06 第36周   项目单元测试用例设计和开发",
          link: "/前端架构/阶段六：前端发布脚手架开发/06 第36周   项目单元测试用例设计和开发",
        },
      ],
    },
  ],
  "/前端架构/阶段七：架构师领导力培养/": [
    {
      text: "阶段七：架构师领导力培养",
      items: [
        {
          text: "00 第37周   大厂如何管理多人协作的研发项目",
          link: "/前端架构/阶段七：架构师领导力培养/00 第37周   大厂如何管理多人协作的研发项目",
        },
      ],
    },
  ],
};
