export default {
  "/进阶/性能优化/": [
    {
      text: "性能优化",
      items: [
        {
          text: "00 Web性能指标",
          link: "/进阶/性能优化/00 Web性能指标",
        },
        {
          text: "01 Web性能测试",
          link: "/进阶/性能优化/01 Web性能测试",
        },
        {
          text: "02 前端页面的生命周期",
          link: "/进阶/性能优化/02 前端页面的生命周期",
        },
      ],
    },
  ],
  "/进阶/技术解决方案/": [
    {
      text: "技术解决方案",
      items: [
        {
          text: "00 前端权限设计与实现",
          link: "/进阶/技术解决方案/00 前端权限设计与实现",
        },
        {
          text: "01 微前端实战",
          link: "/进阶/技术解决方案/01 微前端实战",
        },
      ],
    },
  ],
};
